STMicroelectronics/STM32CubeG4/Projects/STM32G474E-EVAL/Demonstrations/Modules/ucpd/usbpd_pwr_if.c
uint32_t _PWR_SNKFixedPDO(float  _C_, float _V_,
                          USBPD_CORE_PDO_DRDataSupport_TypeDef DRDSupport,
                          USBPD_CORE_PDO_USBCommCapable_TypeDef UsbCommCapable,
                          USBPD_CORE_PDO_ExtPowered_TypeDef ExtPower,
                          USBPD_CORE_PDO_HigherCapability_TypeDef HigherCapab,
                          USBPD_CORE_PDO_DRPowerSupport_TypeDef DRPSupport);

uint32_t _PWR_SNKVariablePDO(float  _MAXV_,float _MINV_,float _C_);

uint32_t _PWR_SNKBatteryPDO(float _MAXV_,float _MINV_,float _PWR_);
#if defined(USBPD_REV30_SUPPORT) && _PPS
uint32_t _PWR_ProgrammablePowerSupplyAPDO(float _MAXC_,float _MINV_,float _MAXV_);
#endif
/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Initialize structures and variables related to power board profiles
  *         used by Sink and Source, for all available ports.
  * @retval USBPD status
*/
/* GNU Compiler */
#if defined(__GNUC__)
/* ARM Compiler */
#elif defined(__CC_ARM)
/* IAR Compiler */
#elif defined(__ICCARM__)
#pragma optimize=none
#endif
USBPD_StatusTypeDef USBPD_PWR_IF_Init(void)
{
  USBPD_StatusTypeDef _status = USBPD_OK;
#if defined(_GUI_INTERFACE)
  uint32_t index;
#endif /* _GUI_INTERFACE */

  /* Set links to PDO values and number for Port 0 (defined in PDO arrays in H file).
   */
#if (PORT0_NB_SOURCEPDO > 0) || (PORT0_NB_SOURCEAPDO > 0)
#if defined(_GUI_INTERFACE)
  for (index = 0; index < USBPD_MAX_NB_PDO; index++)
  {
    PWR_Port_PDO_Storage[USBPD_PORT_0].SourcePDO.ListOfPDO[index] = PORT0_PDO_ListSRC[index];
  }
  PWR_Port_PDO_Storage[USBPD_PORT_0].SourcePDO.NumberOfPDO = NbPDO[1];
#else
  PWR_Port_PDO_Storage[USBPD_PORT_0].SourcePDO.ListOfPDO = (uint32_t *) PORT0_PDO_ListSRC;
  PWR_Port_PDO_Storage[USBPD_PORT_0].SourcePDO.NumberOfPDO = PORT0_NB_SOURCEPDO + PORT0_NB_SOURCEAPDO;
#endif /* _GUI_INTERFACE */
#endif

#if (PORT0_NB_SINKPDO > 0) || (PORT0_NB_SINKAPDO > 0)
#if defined(_GUI_INTERFACE)
  for (index = 0; index < USBPD_MAX_NB_PDO; index++)
  {
    PWR_Port_PDO_Storage[USBPD_PORT_0].SinkPDO.ListOfPDO[index] = PORT0_PDO_ListSNK[index];
  }
  PWR_Port_PDO_Storage[USBPD_PORT_0].SinkPDO.NumberOfPDO = NbPDO[0];
#else
  PWR_Port_PDO_Storage[USBPD_PORT_0].SinkPDO.ListOfPDO = (uint32_t *)PORT0_PDO_ListSNK;
  PWR_Port_PDO_Storage[USBPD_PORT_0].SinkPDO.NumberOfPDO = PORT0_NB_SINKPDO + PORT0_NB_SINKAPDO;
#endif /* _GUI_INTERFACE */
  _status |= USBPD_PWR_IF_CheckUpdateSNKPower(USBPD_PORT_0);
#endif

#if USBPD_PORT_COUNT == 2
  /* Set links to PDO values and number for Port 1 (defined in PDO arrays in H file).
   */
#if (PORT1_NB_SOURCEPDO > 0) || (PORT1_NB_SOURCEAPDO > 0)
#if defined(_GUI_INTERFACE)
  for (index = 0; index < USBPD_MAX_NB_PDO; index++)
  {
    PWR_Port_PDO_Storage[USBPD_PORT_1].SourcePDO.ListOfPDO[index] = PORT1_PDO_ListSRC[index];
  }
  PWR_Port_PDO_Storage[USBPD_PORT_1].SourcePDO.NumberOfPDO = NbPDO[3];
#else
  PWR_Port_PDO_Storage[USBPD_PORT_1].SourcePDO.ListOfPDO = (uint32_t *)PORT1_PDO_ListSRC;
  PWR_Port_PDO_Storage[USBPD_PORT_1].SourcePDO.NumberOfPDO = PORT1_NB_SOURCEPDO + PORT1_NB_SOURCEAPDO;
#endif /* _GUI_INTERFACE */
#endif

#if (PORT1_NB_SINKPDO > 0) || (PORT1_NB_SINKAPDO > 0)
#if defined(_GUI_INTERFACE)
  for (index = 0; index < USBPD_MAX_NB_PDO; index++)
  {
    PWR_Port_PDO_Storage[USBPD_PORT_1].SinkPDO.ListOfPDO[index] = PORT1_PDO_ListSNK[index];
  }
  PWR_Port_PDO_Storage[USBPD_PORT_1].SinkPDO.NumberOfPDO = NbPDO[2];
#else
  PWR_Port_PDO_Storage[USBPD_PORT_1].SinkPDO.ListOfPDO = (uint32_t *)PORT1_PDO_ListSNK;
  PWR_Port_PDO_Storage[USBPD_PORT_1].SinkPDO.NumberOfPDO = PORT1_NB_SINKPDO + PORT1_NB_SINKAPDO;
#endif /* _GUI_INTERFACE */
  _status |= USBPD_PWR_IF_CheckUpdateSNKPower(USBPD_PORT_1);
#endif

#endif /* USBPD_PORT_COUNT == 2 */

  return _status;
}

#if defined(_SRC) || defined(_DRP)
/**
  * @brief  Sets the required power profile, now it works only with Fixed ones
  * @param  PortNum               Port number
  * @retval USBPD status
*/
USBPD_StatusTypeDef USBPD_PWR_IF_SetProfile(uint8_t PortNum)
{
  USBPD_StatusTypeDef      _ret = USBPD_ERROR;
  USBPD_PDO_TypeDef        _pdo;
  USBPD_SNKRDO_TypeDef     _rdo;
#if defined(USBPD_REV30_SUPPORT) && _PPS && defined(DCDC_VREF_PWM)
  static USBPD_SNKRDO_TypeDef _rdo_previous = {
                                                .d32 = 0
                                              };
#endif /* USBPD_REV30_SUPPORT && _PPS && DCDC_VREF_PWM */

  uint32_t _vbusTargetInmv = 0;
  uint32_t _PowerProfileSelected =  DPM_Ports[PortNum].DPM_RDOPosition - 1;
  uint8_t counter = 0;

  /* Check if valid port */
  /* Check if profile nb is valid for this port */
  if(( !USBPD_PORT_IsValid(PortNum) ) || (_PowerProfileSelected >= PWR_Port_PDO_Storage[PortNum].SourcePDO.NumberOfPDO)
     || (0 == PWR_Port_PDO_Storage[PortNum].SourcePDO.NumberOfPDO))
  {
    return _ret;
  }

  _pdo.d32 = PWR_Port_PDO_Storage[PortNum].SourcePDO.ListOfPDO[_PowerProfileSelected];
  _rdo.d32 = DPM_Ports[PortNum].DPM_RcvRequestDOMsg;

  switch(_pdo.GenericPDO.PowerObject)
  {
  case USBPD_CORE_PDO_TYPE_FIXED :
    {
      _vbusTargetInmv               = _pdo.SRCFixedPDO.VoltageIn50mVunits * 50;
      uint32_t _OperatingCurrent    = _rdo.FixedVariableRDO.OperatingCurrentIn10mAunits * 10;
      uint32_t _MaxOperatingCurrent = _rdo.FixedVariableRDO.MaxOperatingCurrent10mAunits * 10;

      _ret = BSP_PWR_VBUSSetVoltage_Fixed(PortNum, _vbusTargetInmv, _OperatingCurrent, _MaxOperatingCurrent) == PWR_OK ? USBPD_OK: USBPD_ERROR;
      break;
    }
  case USBPD_CORE_PDO_TYPE_VARIABLE :
    {
      _vbusTargetInmv               = _pdo.SRCVariablePDO.MinVoltageIn50mVunits * 50;
      uint32_t _vbusTargetMaxInmv   = _pdo.SRCVariablePDO.MaxVoltageIn50mVunits * 50;
      uint32_t _OperatingCurrent    = _rdo.FixedVariableRDO.OperatingCurrentIn10mAunits * 10;
      uint32_t _MaxOperatingCurrent = _rdo.FixedVariableRDO.MaxOperatingCurrent10mAunits * 10;

      _ret = BSP_PWR_VBUSSetVoltage_Variable(PortNum, _vbusTargetInmv, _vbusTargetMaxInmv, _OperatingCurrent, _MaxOperatingCurrent) == PWR_OK ? USBPD_OK: USBPD_ERROR;
      break;
    }
  case USBPD_CORE_PDO_TYPE_BATTERY :
    {
      /* not yet impelmented */
      return _ret;
      break;
    }
#if defined(USBPD_REV30_SUPPORT) && _PPS && defined(DCDC_VREF_PWM)
  case USBPD_CORE_PDO_TYPE_APDO :
    {
      _vbusTargetInmv      = _rdo.ProgRDO.OutputVoltageIn20mV * 20;
      uint32_t _OperatingCurrent    = _rdo.ProgRDO.OperatingCurrentIn50mAunits * 50;
      int32_t _delta = 0;
      if(_rdo.ProgRDO.ObjectPosition == _rdo_previous.ProgRDO.ObjectPosition)
      {
        _delta = (_rdo_previous.ProgRDO.OutputVoltageIn20mV - _rdo.ProgRDO.OutputVoltageIn20mV) * 20;
      }
      _ret = BSP_PWR_VBUSSetVoltage_APDO(PortNum, _vbusTargetInmv, _OperatingCurrent, _delta) == PWR_OK ? USBPD_OK: USBPD_ERROR;
      break;
    }
#endif /* USBPD_REV30_SUPPORT && _PPS */
  }

#if defined(USBPD_REV30_SUPPORT) && _PPS
  /* save the previous rd, mainly for APDO management */
  _rdo_previous.d32 = _rdo.d32;

  if (_ret != USBPD_OK)
  {
    _rdo_previous.d32 = 0;
    return _ret;
  }
  else
#endif /* USBPD_REV30_SUPPORT && _PPS */
  {
    /* before sending PS_READY if the power is at the expected level */
    int32_t _delta;
    uint32_t _vbusOriginInmv;
    uint8_t _exit = 0;

    /* Set the power, the precision must be at 5% for a fixed PDO */
    uint32_t _precision = (_vbusTargetInmv * 5) / 100;
    do {
      counter++;
      USBPD_DPM_WaitForTime(5);
      _vbusOriginInmv = BSP_PWR_VBUSGetVoltage(PortNum);
#ifdef _TRACE
      char str[10];
      sprintf(str, "V:%5d", _vbusOriginInmv);
      POWER_IF_TRACE(PortNum, (uint8_t*)str, strlen(str));
#endif /* _TRACE */
      _delta = _vbusOriginInmv - _vbusTargetInmv;
      if((ABS(_delta)) < _precision)
      {
        _exit = 1;
      }
    }while((_exit == 0) && (counter < 25));
  }

  if (25 == counter)
    return USBPD_FAIL;
  else
    return USBPD_OK;
}
#endif /* _SRC|| _DRP */


/**
  * @brief  Resets the Power Board
  * @retval USBPD status
*/
USBPD_StatusTypeDef USBPD_PWR_IF_PowerResetGlobal(void)
{
  int i = 0;

  /* Resets all the ports */
  for(i = 0; i < USBPD_PORT_COUNT; i++)
  {
    USBPD_PWR_IF_PowerReset(i);
  }
  return USBPD_OK;
}

/**
  * @brief  Resets the Power on a specified port
  * @param  PortNum Port number
  * @retval USBPD status
*/
USBPD_StatusTypeDef USBPD_PWR_IF_PowerReset(uint8_t PortNum)
{
  /* check for valid port */
  if (!USBPD_PORT_IsValid(PortNum))
  {
    return USBPD_ERROR;
  }
  /* Put the usbpd port into ready to start the application */
  return USBPD_PWR_IF_InitPower(PortNum);
}

